pitzDailyParallel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1000;

vertices
(
    (-0.6 -0.6 0.1) //0
    (0.6 -0.6 0.1) //1
    (0.6 0.6 0.1)//2
    (-0.6 0.6 0.1)//3

    (-0.6 -0.6 2.5) //4
    (0.6 -0.6 2.5) //5
    (0.6 0.6 2.5)//6
    (-0.6 0.6 2.5)//7



);

blocks
(
    hex (0 1 2 3 4 5 6 7 ) (10 10 10) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    wall
    {
      type wall;
      faces
      (
            ( 1 5 4 0)
            (3 7 6 2)
            (4 5 6 7)
            (0 4 7 3)

      )  ;


    }
    inlet
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
